{
    "intro" :[
        "I was an Accountant who is now transitioning into a developer/data analyst.",
        "I attended UC Santa Barbara (go Gauchos!) and graduated with a B.A in Economics."
    ],
    "currently": [
        "I have been beefing up on my developer skills (which includes the creation of this site :) and my knowledge on statistics.",
        "If you're reading this, there is a very high chance that I want to work for your company."
    ],
    "history": [
        "I was born in Colombo, Sri Lanka.",
        "At age 8 or 9 I got my first computer, an IBM Aptiva.",
        "My first email address was nabster609@hotmail.com, unfortunately I do not have access currently.",
        "My family and I moved to the beautiful South Bay(SoCal) in 2002.",
        "At Age 12 I built my first website in my middle school computer class. It was around one of my favorite videogames, Metal Gear Solid. And yes it was terrible.",
        "I played a lot of videogames, including CounterStrike and the infamous World of Warcraft. I quit playing around my senior year of highschool. I sold my account online for $600.",
        "I went to community college after highschool as it wasn't possible to take a student loan out unless you were either a permamnent resident or a U.S citizen. Some of my best professors were from the fine institution known as El Camino Community College, shoutout Professor Ebiner and  Dr. Doyle!",
        "I transferred to UC Santa Barbara. After my first quarter there I received the best Christmas gift of my life, green card status.",
        "While taking Econometrics I was exposed to my first programming language, R.",
        "I graduated and sought work as an Accountant. With daily use of Excel the efficient side of me was forced to learn how to use Excel VBA.",
        "In 2016 I was awarded the annual Corporate Finance Award for Excellence at my job @ Corporate Traveler for developing an automated Excel dashboard for my team. I was scheduled to fly out to Singapore for the company's annual awards conference but learned the hard way that your passport needs to be at least 6 months away from expiring to be able to travel to most countries.",
        "While working I started taking a variety of classes on programming and settled on using Python.",
        "I left my job on good terms to focus on transitioning to a developer/analyst role."
    ],
    "random": [
        "I have a beautiful white German Shephard named Ripley, named after the heroine from the Alien series.",
        "I am right handed but have slowly been learning how to be ambidextrous.",
        "Although I spent the first 12 years of my life in Sri Lanka I do not know the local languages (Sinhala and Tamil).",
        "I can bend my pinkie fingers at perfect 90 degree angles.",
        "I love all types of music, Stevie Wonder is probably my favorite artist.",
        "I am a newb bass player."
    ]
}